/* Автор: студент группы ЗОМ34-ПВШ2616 Золотухин Андрей Александрович
 * СДАП Лабораторная работа 5
 * Язык: C++
 */

#include <iostream>
#include <math.h>
#include <format>

int main() {
	/*
	 * Задача 1
	 */
	std::cout << "--- Задача 1 ---" << std::endl;
	std::cout << "Введите размер квадратной матрицы: ";
	int n; // кол-во строк и столбцов
	std::cin >> n; // чтение числа из пользовательского ввода
	double** a = new double *[n]; // Выдление памяти под массив
	for (int i = 0; i < n; i++)
		a[i] = new double[n];

	// Формирую матрицу с элементами, равными sin((i^2 - j^2)/ n)
	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++)
			a[i][j] = std::sin(double(i * i - j * j) / n);	

	std::cout << "Вывод итоговой матрицы:" << std::endl;
	// Вывод матрицы с форматированием: округление до 2 знаков после запятой
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++)
			std::cout << std::format("{:5.2f}", a[i][j]) << " ";
		std::cout << std::endl;
	}

	int counter = 0; // счётчик для подсчёта количества элементов
 	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++)
			if (a[i][j] > 0) counter++; // считаю только положительный элемент (строго больше нуля)

	// Вывод ответа на 1-ое задание
	std::cout << std::endl << "Количество положительных элементов в матрице: " << counter << std::endl;

	// Освобождаю память
	for (int i = 0; i < n; i++)
		delete[] a[i];
	delete[] a;	
	a = nullptr;
	/*
	 * Конец задачи 1
	 */

	/*
	 * Задача 2
	 */
	std::cout << std::endl << "--- Задача 2 ---" << std::endl;
	std::cout << "Введите количество элементов последовательности (от 1 до 10 включительно): ";
	std::cin >> n; // чтение кол-ва чисел в последовательности и кол-ва строк и столбцов из пользовательского ввода
	std::cout << "Введите " << n << " элементов последовательности (через пробел): ";
	int* x = new int[n];
	for (int i = 0; i < n; i++)
		std::cin >> x[i];

	long long** b = new long long *[n]; // Выдление памяти под массив
	for (int i = 0; i < n; i++)
		b[i] = new long long[n];

	// Формирую матрицу, где i - степень, j - столбец
	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++)
			b[i][j] = std::pow(x[j], i);	

	std::cout << "Вывод итоговой матрицы:" << std::endl;
	// Вывод матрицы
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++)
			std::cout << std::format("{:5}", b[i][j]) << " ";
		std::cout << std::endl;
	}

	// Освобождаю память
	delete[] x;
	x = nullptr;
	for (int i = 0; i < n; i++)
		delete[] b[i];
	delete[] b;	
	b = nullptr;
	/*
	 * Конец задачи 2
	 */

	/*
	 * Задача 3
	 */
	std::cout << std::endl << "--- Задача 3 ---" << std::endl;
	std::cout << "Введите размер квадратной матрицы: ";
	std::cin >> n; // чтение кол-ва чисел в последовательности и кол-ва строк и столбцов из пользовательского ввода

	double** c = new double*[n]; // Выдление памяти под массив
	for (int i = 0; i < n; i++)
		c[i] = new double[n];

	// Формирую матрицу такую, что первая строка 2j + 3, вторая - j-(3/(2+(1/j))), а остальные - сумма двух предыдущих
	for (int j = 0; j < n; j++) {
		c[0][j] = 2.0 * (j + 1) + 3.0;
		c[1][j] = (j + 1.0) - (3.0 / (2.0 + (1.0 / (j + 1.0))));
	}
	for (int i = 2; i < n; i++)
		for (int j = 0; j < n; j++)
			c[i][j] = c[i - 2][j] + c[i - 1][j];

	std::cout << "Вывод итоговой матрицы:" << std::endl;
	// Вывод матрицы
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++)
			std::cout << std::format("{:5.2f}", c[i][j]) << " ";
		std::cout << std::endl;
	}

	// Поиск минимума по строкам и максимум по слобцам
	// Присваиваю за минимум и максимум первый элемент матрицы
	double min = c[0][0];
	double max = c[0][0];

	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++) {
			if (c[i][j] < min) min = c[i][j];
			if (c[i][j] > max) max = c[i][j];
		}
	}

	// Вывод ответа для 3 задачи (среднее арифметическое минимума и максимума)
	std::cout << "Значение среднего арифметического наименьшего по строкам и наибольшего по столбцам элементов матрицы: " << std::format("{:.5f}", (min + max) / 2.0) << std::endl;

	// Освобождаю память
	for (int i = 0; i < n; i++)
		delete[] c[i];
	delete[] c;	
	c = nullptr;
	/*
	 * Конец задачи 3
	 */
	return 0;
}
