// DynamicArray.cpp
// C++ программа иллюстрирует создание простого класса динамического массива,
// который использует операции со ссылкми на память для хранения данных в виде массива
// Автор ОЗНАКОМЛЕН: студент группы ЗОМ34-ПВШ2616 Золотухин Андрей

#include <iostream>

/* Класс DynamicArray управляет массивом, размер которого
   может динамически увеличиваться.
   Класс имеет указатель на массив arr для хранения элементов массива,
   длину size для хранения величины размера массивар
   и переменную capacity для задания динамики изменения длины массива.
*/


class DynamicArray {
    /*
    Класс DynamicArray начинается с объявления частного
    целочисленного указателя arr, который указывает на динамически выделенный массив.
    */
private:
    int* arr; // ссылка на элементы массива
    int size; // размер для отслеживания текущего количества элементов в массиве
    int capacity; // емкость для обозначения общего размера выделенной памяти

public:
    // конструктор класса
    /*
      Конструктор инициализирует динамический массив с начальной емкостью 2.
      Эту начальную емкость можно настроить в зависимости от конкретных требований программы.
    */
    DynamicArray() : size(0),  capacity(2) {
        arr = new int[capacity];
    }
    // деструктор класса
    /*
     Деструктор гарантирует, что выделенная память будет освобождена,
     когда объект выйдет за пределы области видимости.
    */
    ~DynamicArray() {
        delete[] arr;
    }
    // методы класса
    // добавить элемент в массив
    /*
     Метод push_back используется для добавления элементов в динамический массив.
     Если текущий размер массива равен его емкости, это означает, что выделенная
     память заполнена и размер массива необходимо изменить.
     Затем метод создает новый массив с удвоенной ёмкостью,
     копирует существующие элементы в новый массив, удаляет старый массив и
     обновляет указатель на новый массив.
    */
    void push_back(int element) {
        if (size == capacity) {
            int* newArr = new int[capacity + 1];
            for (int i = 0; i < size; i++)
                newArr[i] = arr[i];
            delete[] arr;
            arr = newArr;
            capacity++;
        }
        arr[size++] = element; // записать элемент в массив
    }
    /*
     Метод at — это метод получения, который возвращает элемент по указанному индексу.
     Он включает проверку границ для предотвращения доступа к элементам за пределами
     допустимого диапазона массива.
    */
    int at(int index) const {
        if (index < 0 || index >= size)
            throw std::out_of_range("Index out of bounds");// сообщение об ошибке
        return arr[index]; // возвращает элемент по его индексу в массиве
    }
    /*
     Методы getSize и getCapacity — это простые функции доступа для получения
     текущего размера и ёмкости динамического массива соответственно.
    */
    int getSize() const {
        return size; // вернуть значение размера массива
    }

    int getCapacity() const {
        return capacity; // вернуть значение ёмкости массива
    }
};
// Основная программа
/*
 Создаём экземпляр DynamicArray и элементы в массив
 добавляются с помощью метода push_back в цикле.
 Демонстрируем динамическую природу массива, который может расти по мере необходимости.
*/
int main() {
    DynamicArray dynArray; // Объявить и создать массив dynArray начальной ёмкости 2

    // записываем элементы в массив (я выбрал квадраты чисел от 1 до 10)
    for (int i = 1; i <= 10; i++)
        dynArray.push_back(i * i);

    // выводим информацию о размере и ёмкости созданного массива
   std::cout << "Размер нашего динамического массива: " << dynArray.getSize() << std::endl;
   std::cout << "Ёмкость нашего динамического массива: " << dynArray.getCapacity() << std::endl;
    // выводим информацию о индексах и значений элементов массива
    for (int i = 0; i < dynArray.getSize(); i++)
        std::cout << "Элемента индекса " << i << ": " << dynArray.at(i) << std::endl;
    return 0;
}
