/* Автор: студент группы ЗОМ34-ПВШ2616 Золотухин Андрей Александрович
 * СДАП Лабораторная работа 7
 * Язык: C++
 */

#include <iostream>
#include <set>
#include <vector>
#include <utility>

// замена, чтобы не писать очень длинный тип данных
typedef std::pair<int, int> pairs;

// функция для вывода массива пар
void display_pairs(const std::set<pairs> s) {
	bool found = false; // флаг о том, есть ли пары в сете

	// вывести, если есть элементы в массиве
	for (auto const &el: s) {
		found = true;
		std::cout << "(" << el.first << ", " << el.second << ")" << " ";
	}

	if (not found)
		std::cout << "Никаких пар нет.";
}

int main() {
	/*
	 * Задача 1
	 * нахождение последовательности пар четных чисел без повторений, разделённых пробелом
	 */
	std::cout << (std::make_pair(2, 4) == std::make_pair(2, 4)) << std::endl;
	std::cout << "--- Задача 1 ---" << std::endl;
	std::cout << "Поиск пар чётных чисел без повторений" << std::endl;
	int data; // переменная, в которую записывается пользовательский ввод
	std::vector<int> v; // вектор, в который сохраняется пользовательный ввод
	std::set<pairs> sEven; // сет пар для хранения пар чётных чисел

	std::cout << "Вводите числа через пробел: "; // информация о том, что ждёт программа от пользователя
	// ввод строки данных из потока до конца строки
	while (std::cin.peek() != '\n') {
		std::cin >> data;
		v.push_back(data);
	}

	// анализ данных
	for (int i = 0; i < v.size() - 1; i++) {
		for (int j = i + 1; j < v.size(); j++) {
			// проверка чисел на четность
			if ((v[i] % 2 == 0) && (v[j] % 2 == 0)) {
				// создать пару из четных чисел
				pairs x = std::make_pair(v[i], v[j]);

				// создание противоположной упорядоченной пары, считая, что (x, y) = (y, x), исходя и примера 4 4 6 4, где в выводе было (4, 6), но не было (6, 4)
				pairs swapX = std::make_pair(v[j], v[i]);
				if (sEven.find(swapX) == sEven.end())
					// сохранить в сет пар чётных чисел
					sEven.insert(x);
			}
		}
	}

	// отобразить результат
	std::cout << "Пары чётных чисел: ";	// для понятного вывода	
	display_pairs(sEven);
	std::cout << std::endl << std::endl;

	// очистить сет пар
	sEven.clear();
	/*
	 * Конец задачи 1
	 */

	/*
	 * Задача 2
	 * нахождение последовательности пар четных чисел без повторений, разделённых пробелом
	 */
	std::cout << "--- Задача 2 ---" << std::endl;
	std::cout << "Поиск количества различных чисел массива" << std::endl;
	std::cout << "Введите число элементов массива: ";
	int N;
	std::cin >> N; // чтение количества элементов массива
	std::cout << "Вводите элементы массива через пробел: ";
	std::vector<int> a(N, 0); // сам массив
	for (int i = 0; i < N; i++)
		std::cin >> a[i];	

	// создание сета и присвоение ему чисел из вектора, чтобы оставить лишь уникальные
	std::set<int> ans;
	for (int i = 0; i < N; i++)
		ans.insert(a[i]);
	
	int amountOfNumbers = ans.size(); // переменная для хранения количества различных чисел массива
	std::cout << "Количество различных чисел в массиве: " << amountOfNumbers << std::endl;
	/*
	 * Конец задачи 2
	 */

	return 0;
}
