// z2.cpp
// C++ программа иллюстрирует одну из задач
// Автор ОЗНАКОМЛЕН: студент группы ЗОМ34-ПВШ2616 Золотухин Андрей Александрович

#include <iostream>
int main() {
	int n; // кол-во строк и столбцов
	std::cin >> n; // чтение числа из пользовательского ввода
	int** a = new int *[n]; // Выдление памяти под массив
	for (int i = 0; i < n; i++)
		a[i] = new int[n];

	// Формирую матрицу, где на главной диагонали единицы, ниже главной - двойки, выше - нули
	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++) {
			if (j < i) a[i][j] = 2;
			if (j == i) a[i][j] = 1;
			if (j > i) a[i][j] = 0;
	}

	// Вывод матрицы	
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++)
			std::cout << a[i][j] << " ";
		std::cout << std::endl;
	}

	// В примере нет, но меня всегда учили освобождать память после её выделения
	for (int i = 0; i < n; i++)
		delete[] a[i];
	delete[] a;

	return 0;
}
