// array2.cpp
// C++ программа иллюстрирует определение массива 2D nxn
// Автор ОЗНАКОМЛЕН: студент группы ЗОМ34-ПВШ2616 Золотухин Андрей Александрович

#include <iostream>
int main() {
	int n; // кол-во строк и столбцов
	std::cin >> n; // чтение числа из пользовательского ввода
	int** a = new int *[n]; // Выдление памяти под массив
	for (int i = 0; i < n; i++)
		a[i] = new int[n];

	// создаю единичную матрицу (матрица, где на главной диагонали находятся единицы, а на остальных - нули
	for (int i = 0; i < n; i++)
		for (int j = 0; j < n; j++)
			a[i][j] = (i == j) ? 1 : 0; // сократил до одной строчки при помощи тернарного оператора

	// Вывод матрицы	
	for (int i = 0; i < n; i++) {
		for (int j = 0; j < n; j++)
			std::cout << a[i][j] << " ";
		std::cout << std::endl;
	}

	// В примере нет, но меня всегда учили освобождать память после её выделения
	for (int i = 0; i < n; i++)
		delete[] a[i];
	delete[] a;

	return 0;
}
